tap "getsentry/tools"
tap "heroku/brew"

brew "awscli"
brew "deno"
brew "direnv"
brew "ffmpeg"
brew "gh"
brew "git"
brew "heroku"
brew "imagemagick"
brew "libyaml" # for ruby 3.2+
brew "mas"
brew "mise"
brew "poppler" # PDF rendering library (pdftoppm / pdfinfo CLI tools)
brew "postgresql@18", restart_service: :changed
brew "redis", restart_service: :changed
brew "tokei"
brew "watch"
brew "wget"
brew "getsentry/tools/sentry-wizard", trusted: true

cask "1password"
cask "calibre"
cask "coconutbattery"
cask "daisydisk"
cask "figma"
cask "firefox"
cask "font-meslo-lg-nerd-font" # powerline/agnoster glyphs
cask "gcloud-cli"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "notion"
cask "onedrive"
cask "orbstack"
cask "postico"
cask "postman"
cask "proxyman"
cask "rescuetime"
cask "rocket-typist"
cask "sim-genie"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "swiftformat-for-xcode"
cask "transmit"
cask "visual-studio-code"
cask "vlc"

# Mac App Store apps. Requires being signed into the App Store first.
mas "Copilot", id: 1447330651
mas "Dato", id: 1470584107
mas "DevCleaner", id: 1388020431
mas "WhatsApp", id: 310633997
